In [569]:
import pandas as pd
import numpy as np

# The URL for the Titanic dataset
url = 'https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv'

# Your code here
titanic_df = pd.read_csv(url)

In [570]:
titanic_df.sample(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
400,401,1,3,"Niskanen, Mr. Juha",male,39.0,0,0,STON/O 2. 3101289,7.9250,NaN,S
570,571,1,2,"Harris, Mr. George",male,62.0,0,0,S.W./PP 752,10.5000,NaN,S
132,133,0,3,"Robins, Mrs. Alexander A (Grace Charity Laury)",female,47.0,1,0,A/5. 3337,14.5000,NaN,S
162,163,0,3,"Bengtsson, Mr. John Viktor",male,26.0,0,0,347068,7.7750,NaN,S
522,523,0,3,"Lahoud, Mr. Sarkis",male,NaN,0,0,2624,7.2250,NaN,C
117,118,0,2,"Turpin, Mr. William John Robert",male,29.0,1,0,11668,21.0000,NaN,S
871,872,1,1,"Beckwith, Mrs. Richard Leonard (Sallie Monypeny)",female,47.0,1,1,11751,52.5542,D35,S
829,830,1,1,"Stone, Mrs. George Nelson (Martha Evelyn)",female,62.0,0,0,113572,80.0000,B28,NaN
384,385,0,3,"Plotcharsky, Mr. Vasil",male,NaN,0,0,349227,7.8958,NaN,S
793,794,0,1,"Hoyt, Mr. William Fisher",male,NaN,0,0,PC 17600,30.6958,NaN,C

In [571]:
titanic_df.shape

(891, 12)

In [572]:
titanic_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [573]:
titanic_df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [574]:
titanic_df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [575]:
titanic_df.describe(include=[object])

                           Name   Sex  Ticket    Cabin Embarked
count                       891   891     891      204      889
unique                      891     2     681      147        3
top     Braund, Mr. Owen Harris  male  347082  B96 B98        S
freq                          1   577       7        4      644

In [576]:
titanic_df.Pclass.nunique()

3

In [577]:
titanic_df.Pclass.unique()

array([3, 1, 2], dtype=int64)

In [578]:
titanic_df.Pclass.value_counts()

Pclass
3    491
1    216
2    184
Name: count, dtype: int64

In [579]:
titanic_df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [580]:
(titanic_df.isnull().sum() / len(titanic_df)) * 100

PassengerId     0.000000
Survived        0.000000
Pclass          0.000000
Name            0.000000
Sex             0.000000
Age            19.865320
SibSp           0.000000
Parch           0.000000
Ticket          0.000000
Fare            0.000000
Cabin          77.104377
Embarked        0.224467
dtype: float64

In [581]:
titanic_df['Fare'].median()

14.4542

In [582]:
titanic_df['Age'].median()

28.0

In [583]:
if titanic_df['Age'].isnull().any():
    titanic_df['Age'] = titanic_df['Age'].fillna(28.0)

In [584]:
titanic_df['Age'].isnull().sum()

0

In [585]:
titanic_df['Embarked'].mode()

0    S
Name: Embarked, dtype: object

In [586]:
titanic_df['Embarked'].fillna(titanic_df['Embarked'].mode(), inplace=True)

C:\Users\Youssef\AppData\Local\Temp\ipykernel_3100\2915270197.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  titanic_df['Embarked'].fillna(titanic_df['Embarked'].mode(), inplace=True)

In [587]:
titanic_df['Embarked'].isnull().sum()

2

In [588]:
titanic_df = titanic_df.drop('Cabin', axis=1)

In [589]:
titanic_df['Age'] = titanic_df['Age'].astype(int)

In [590]:
titanic_df['Age'] = titanic_df['Age'].astype(int)

In [591]:
titanic_df['Survived'] = titanic_df['Survived'].astype('category')

In [592]:
titanic_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    category
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          891 non-null    int32
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Embarked     889 non-null    object
dtypes: category(1), float64(1), int32(1), int64(4), object(4)
memory usage: 67.2+ KB

In [593]:
titanic_df['Sex_numeric'] = titanic_df['Sex'].replace(["male", "female"], [0 , 1])

C:\Users\Youssef\AppData\Local\Temp\ipykernel_3100\190455696.py:1: FutureWarning: Downcasting behavior in `replace` is deprecated and will be removed in a future version. To retain the old behavior, explicitly call `result.infer_objects(copy=False)`. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  titanic_df['Sex_numeric'] = titanic_df['Sex'].replace(["male", "female"], [0 , 1])

In [594]:
titanic_ml = titanic_df

In [595]:
titanic_ml['Embarked_S'] = (titanic_ml['Embarked'] == 'S').astype(int)
titanic_ml['Embarked_C'] = (titanic_ml['Embarked'] == 'C').astype(int)
titanic_ml['Embarked_Q'] = (titanic_ml['Embarked'] == 'Q').astype(int)

In [596]:
titanic_ml.drop(['Sex', 'Embarked'], axis=1, inplace=True)

In [597]:
titanic_ml.drop(['Name', 'Ticket', 'PassengerId'], axis=1, inplace=True)

In [598]:
titanic_ml.head(5)

,Survived,Pclass,Age,SibSp,Parch,Fare,Sex_numeric,Embarked_S,Embarked_C,Embarked_Q
0,0,3,22,1,0,7.2500,0,1,0,0
1,1,1,38,1,0,71.2833,1,0,1,0
2,1,3,26,0,0,7.9250,1,1,0,0
3,1,1,35,1,0,53.1000,1,1,0,0
4,0,3,35,0,0,8.0500,0,1,0,0

In [599]:
titanic_ml.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 10 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Survived     891 non-null    category
 1   Pclass       891 non-null    int64
 2   Age          891 non-null    int32
 3   SibSp        891 non-null    int64
 4   Parch        891 non-null    int64
 5   Fare         891 non-null    float64
 6   Sex_numeric  891 non-null    int64
 7   Embarked_S   891 non-null    int32
 8   Embarked_C   891 non-null    int32
 9   Embarked_Q   891 non-null    int32
dtypes: category(1), float64(1), int32(4), int64(4)
memory usage: 49.8 KB

In [600]:
display(titanic_df)

,Survived,Pclass,Age,SibSp,Parch,Fare,Sex_numeric,Embarked_S,Embarked_C,Embarked_Q
0,0,3,22,1,0,7.2500,0,1,0,0
1,1,1,38,1,0,71.2833,1,0,1,0
2,1,3,26,0,0,7.9250,1,1,0,0
3,1,1,35,1,0,53.1000,1,1,0,0
4,0,3,35,0,0,8.0500,0,1,0,0
...,...,...,...,...,...,...,...,...,...,...
886,0,2,27,0,0,13.0000,0,1,0,0
887,1,1,19,0,0,30.0000,1,1,0,0
888,0,3,28,1,2,23.4500,1,1,0,0
889,1,1,26,0,0,30.0000,0,0,1,0
890,0,3,32,0,0,7.7500,0,0,0,1

In [601]:
titanic_df['FamilySize'] = (titanic_df['SibSp'] + titanic_df['Parch']) + 1

In [602]:
titanic_df['IsAlone'] = titanic_df['FamilySize'] == 1

In [603]:
titanic_df[['SibSp', 'Parch', 'FamilySize','IsAlone']].head(5)

   SibSp  Parch  FamilySize  IsAlone
0      1      0           2    False
1      1      0           2    False
2      0      0           1     True
3      1      0           2    False
4      0      0           1     True

In [604]:
titanic_df.loc[titanic_df['Age'] <= 12, 'AgeGroup'] = 'Child'
titanic_df.loc[(titanic_df['Age'] >= 13) & (titanic_df['Age'] <= 19), 'AgeGroup'] = 'Teen'
titanic_df.loc[(titanic_df['Age'] >= 20) & (titanic_df['Age'] <= 59), 'AgeGroup'] = 'Adult'
titanic_df.loc[titanic_df['Age'] >= 60, 'AgeGroup'] = 'Senior'

In [605]:
titanic_df['AgeGroup'].value_counts()

AgeGroup
Adult     701
Teen       95
Child      69
Senior     26
Name: count, dtype: int64

In [606]:
titanic_df['Fare_Per_Person'] = titanic_df['Fare'] / titanic_df['FamilySize']

In [607]:
titanic_df[['Fare', 'FamilySize', 'Fare_Per_Person']].head(5)

      Fare  FamilySize  Fare_Per_Person
0   7.2500           2          3.62500
1  71.2833           2         35.64165
2   7.9250           1          7.92500
3  53.1000           2         26.55000
4   8.0500           1          8.05000

In [608]:
titanic_df.groupby('Survived')['Fare_Per_Person'].mean()

C:\Users\Youssef\AppData\Local\Temp\ipykernel_3100\3932081847.py:1: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  titanic_df.groupby('Survived')['Fare_Per_Person'].mean()

Survived
0    13.651162
1    29.973691
Name: Fare_Per_Person, dtype: float64

In [609]:
titanic_df.groupby('Survived')['FamilySize'].mean()

C:\Users\Youssef\AppData\Local\Temp\ipykernel_3100\3547030788.py:1: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  titanic_df.groupby('Survived')['FamilySize'].mean()

Survived
0    1.883424
1    1.938596
Name: FamilySize, dtype: float64

In [610]:
titanic_df['IsAlone'] = titanic_df['IsAlone'].astype(int)
titanic_df['Survived'] = titanic_df['Survived'].astype(int)

titanic_df.groupby('IsAlone')['Survived'].mean()

IsAlone
0    0.505650
1    0.303538
Name: Survived, dtype: float64

In [611]:
titanic_df['Fare_Per_Person'].max()

512.3292

In [612]:
titanic_df['FamilySize'].max()

11

In [613]:
titanic_df.groupby(['Pclass', 'Sex_numeric'])['Survived'].mean()

Pclass  Sex_numeric
1       0              0.368852
        1              0.968085
2       0              0.157407
        1              0.921053
3       0              0.135447
        1              0.500000
Name: Survived, dtype: float64

In [614]:
titanic_df

,Survived,Pclass,Age,SibSp,Parch,Fare,Sex_numeric,Embarked_S,Embarked_C,Embarked_Q,FamilySize,IsAlone,AgeGroup,Fare_Per_Person
0,0,3,22,1,0,7.2500,0,1,0,0,2,0,Adult,3.62500
1,1,1,38,1,0,71.2833,1,0,1,0,2,0,Adult,35.64165
2,1,3,26,0,0,7.9250,1,1,0,0,1,1,Adult,7.92500
3,1,1,35,1,0,53.1000,1,1,0,0,2,0,Adult,26.55000
4,0,3,35,0,0,8.0500,0,1,0,0,1,1,Adult,8.05000
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,27,0,0,13.0000,0,1,0,0,1,1,Adult,13.00000
887,1,1,19,0,0,30.0000,1,1,0,0,1,1,Teen,30.00000
888,0,3,28,1,2,23.4500,1,1,0,0,4,0,Adult,5.86250
889,1,1,26,0,0,30.0000,0,0,1,0,1,1,Adult,30.00000
890,0,3,32,0,0,7.7500,0,0,0,1,1,1,Adult,7.75000

In [615]:
# Example calculation
male_survival_rate = titanic_df[titanic_df['Sex_numeric'] == 1]['Survived'].mean()
print(f"Survival rate for male passengers: {male_survival_rate:.2%}")

Survival rate for male passengers: 74.20%

In [616]:
titanic_df.groupby('AgeGroup')['Survived'].mean()

AgeGroup
Adult     0.365193
Child     0.579710
Senior    0.269231
Teen      0.410526
Name: Survived, dtype: float64

In [617]:
titanic_df[(titanic_df['Pclass'] == 1) & (titanic_df['Sex_numeric'] == 0)]['Survived'].mean()

0.36885245901639346

In [618]:
titanic_df[(titanic_df['Pclass'] == 3) & (titanic_df['Sex_numeric'] == 1)]['Survived'].mean()

0.5

In [619]:
titanic_df[(titanic_df['Pclass'] == 3) & (titanic_df['AgeGroup'] == 'Child')]['Survived'].mean()

0.4166666666666667

In [620]:
titanic_df.groupby('AgeGroup')['Fare'].mean()

AgeGroup
Adult     31.882233
Child     31.536352
Senior    43.467950
Teen      31.982414
Name: Fare, dtype: float64

In [621]:
titanic_df[(titanic_df['Fare'] < titanic_df['Fare'].median())]['Survived'].mean()

0.25227272727272726

In [622]:
titanic_df[(titanic_df['Fare'] > titanic_df['Fare'].median())]['Survived'].mean()

0.5180180180180181

In [623]:
titanic_df.groupby('IsAlone')['Survived'].mean()
# People traveling with families had a better survival rate

IsAlone
0    0.505650
1    0.303538
Name: Survived, dtype: float64

In [624]:
titanic_df[titanic_df['FamilySize'] == 2]['Survived'].mean()

0.5527950310559007

In [625]:
titanic_df[titanic_df['FamilySize'] == 3]['Survived'].mean()

0.5784313725490197

In [626]:
titanic_df[titanic_df['FamilySize'] == 4]['Survived'].mean()

0.7241379310344828

In [627]:
titanic_df[titanic_df['FamilySize'] > 4]['Survived'].mean()

0.16129032258064516

In [628]:
titanic_df[titanic_df['Survived'] == True]['Age'].max()

80

In [629]:
titanic_df[(titanic_df['Survived'] == True) & (titanic_df['Age'] > 0)]['Age'].min()

1

In [630]:
titanic_df[(titanic_df['AgeGroup'] == 'Child') & (titanic_df['Pclass'] == 1)].count()

Survived           4
Pclass             4
Age                4
SibSp              4
Parch              4
Fare               4
Sex_numeric        4
Embarked_S         4
Embarked_C         4
Embarked_Q         4
FamilySize         4
IsAlone            4
AgeGroup           4
Fare_Per_Person    4
dtype: int64

In [631]:
titanic_df[(titanic_df['AgeGroup'] == 'Child') & (titanic_df['Pclass'] == 1)]['Survived'].mean()

0.75

In [632]:
fare_np = np.array(titanic_df['Fare_Per_Person'])
age_np = np.array(titanic_df['Age'])

In [633]:
print(np.mean(fare_np))
print(np.median(fare_np))
print(np.std(fare_np))
print(np.min(fare_np))
print(np.max(fare_np))

19.916375111917638
8.3
35.82113871450563
0.0
512.3292

In [634]:
print(np.mean(age_np))
print(np.median(age_np))
print(np.std(age_np))
print(np.min(age_np))
print(np.max(age_np))

29.34567901234568
28.0
13.020898804757042
0
80

In [635]:
fare_np[fare_np > 100]

array([123.7604 , 146.5208 , 512.3292 , 135.6333 , 123.7604 , 110.8833 ,
       135.6333 , 134.5    , 135.6333 , 227.525  , 221.7792 , 106.425  ,
       227.525  , 153.4625 , 256.1646 , 105.66875, 113.7625 , 151.55   ,
       227.525  , 211.3375 , 512.3292 , 105.66875])

In [636]:
age_np[age_np > 40].mean()

51.195945945945944

In [637]:
bool_mask = fare_np > 50

In [638]:
adjusted_fare_np = fare_np.copy()

In [639]:
adjusted_fare_np[bool_mask] * 1.10

array([ 57.04875   ,  80.58644   ,  88.        ,  80.85      ,
        62.14538   ,  57.2       , 136.13644   ,  87.12      ,
        62.14538   , 161.17288   ,  62.30125   ,  83.92087   ,
        87.12      ,  95.15      , 563.56212   ,  84.404375  ,
       149.19663   ,  86.735     , 136.13644   , 121.97163   ,
        59.895     ,  62.62212   ,  91.47413   ,  57.7225    ,
        60.45112333, 149.19663   ,  84.404375  ,  73.5075    ,
       147.95      ,  76.23      , 149.19663   ,  77.55      ,
       250.2775    ,  80.85      ,  62.30125   ,  57.2       ,
        95.15      ,  59.895     ,  62.14538   , 102.85      ,
       243.95712   , 117.0675    ,  58.53375   , 250.2775    ,
       168.80875   ,  85.75413   ,  76.23      ,  62.14538   ,
       281.78106   ,  84.40212   , 116.235625  ,  62.14538   ,
       125.13875   , 166.705     , 250.2775    , 232.47125   ,
       563.56212   ,  57.7225    ,  95.15      , 116.235625  ,
        87.12      ,  62.14538   ,  88.        ,  62.14538   ,
        60.45112333,  55.54538   ])

In [640]:
adjusted_fare_np.sum() - fare_np.sum()

0.0

In [641]:
titanic_df['adjusted_fare_np'] = adjusted_fare_np

In [642]:
np_array_male_fare_thirdclass = np.array(titanic_df[(titanic_df['Sex_numeric'] == 1) & (titanic_df['Pclass'] == 3)]['Fare'])

In [643]:
np.mean(np_array_male_fare_thirdclass)

16.118809722222224

In [644]:
np_array_female_firstclass = np.array(titanic_df[(titanic_df['Sex_numeric'] == 0) & (titanic_df['Pclass'] == 1)]['Age'])

In [645]:
np.median(np_array_female_firstclass)

36.0

In [646]:
np.corrcoef(titanic_df['FamilySize'], titanic_df['Fare_Per_Person'])

array([[ 1.        , -0.09917255],
       [-0.09917255,  1.        ]])

In [647]:
age_standardized = np.array((titanic_df['Age'] - titanic_df['Age'].mean()) / titanic_df['Age'].std())

In [648]:
fare_standardized = np.array((titanic_df['Fare'] - titanic_df['Fare'].mean()) / titanic_df['Fare'].std())

In [649]:
titanic_df.iloc[np.argmax(np.abs(age_standardized))]

Survived                 1
Pclass                   1
Age                     80
SibSp                    0
Parch                    0
Fare                  30.0
Sex_numeric              0
Embarked_S               1
Embarked_C               0
Embarked_Q               0
FamilySize               1
IsAlone                  1
AgeGroup            Senior
Fare_Per_Person       30.0
adjusted_fare_np      30.0
Name: 630, dtype: object

In [650]:
titanic_df.iloc[np.argmax(np.abs(fare_standardized))]

Survived                   1
Pclass                     1
Age                       35
SibSp                      0
Parch                      0
Fare                512.3292
Sex_numeric                1
Embarked_S                 0
Embarked_C                 1
Embarked_Q                 0
FamilySize                 1
IsAlone                    1
AgeGroup               Adult
Fare_Per_Person     512.3292
adjusted_fare_np    512.3292
Name: 258, dtype: object

In [651]:
titanic_df[age_standardized > 1]['Survived'].mean()

0.3643410852713178